# 编写 5的阶乘递归函数

# 实现过程

# 5的阶乘 = 5 * (4 * (3 * (2 * 1)))
# 4的阶乘 = 4 * (3 * (2 * 1))
# 3的阶乘 = 3 * (2 * 1)
# 2的阶乘 = 2 * (1 * 1)

# 1*2*3*4*5 = 120

# ===> factorial(5)
# ===> 5 * factorial(5-1)
# ===> 5 * (4 * factorial(5-1-1))
# ===> 5 * (4 * (3 * factorial(5-1-1-1)))
# ===> 5 * (4 * (3 * (2 * factorial(5-1-1-1-1))))

# ===> 5 * (4 * (3 * (2 * 1)))
# ===> 5 * (4 * (3 * 2))
# ===> 5 * (4 * 6)
# ===> 5 * 24
# ===> 120

def factorial(num):
    # 基数条件 ： 递归函数中 最小的一个值，分解到不能再分解了；
    if num == 1:
        return 1 * 1
    # 递归条件
    result = num * factorial(num - 1)
    return result


print(factorial(4))


# 5的累计求和：



